---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SteelElementFailures.SteelElementModifyParametersTaskNotFinished
source: html/9daacdc7-afc9-de34-fbec-775a1f166743.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SteelElementFailures.SteelElementModifyParametersTaskNotFinished Property

Cannot modify parameters while background calculations are in progress.

## Syntax (C#)
```csharp
public static FailureDefinitionId SteelElementModifyParametersTaskNotFinished { get; }
```